takahashi/docs/ruby_for_beginner.org
# 本記述内のプログラムのサンプルはsample_progフォルダに記載

# 13:00 2018/7/21 -

* 1. はじめてのRuby

** イントロダクション

　それではRubyを使ってみましょう。
　この章では次の内容について紹介します。Rubyを使ったプログラミングの概要をつかんでください。

・Rubyを使う- Rubyを使って、プログラムを実行してみます。
・文字や数値を使う- 文字や数値を出力したり、計算を行ったり、変数に代入したりします。
・条件判断や繰り返しを行う- 数値や文字列を比較して条件判断や、処理の繰り返しを行います。

# 冒頭に今回の章で学ぶ内容の概要を示しているため、何が身につくのかわかりやすい

** 1.1. Rubyの実行方法

*** イントロダクション

　まずは、画面に文字を表示するプログラムを作り、実行してみましょう。
　Rubyで書かれたプログラムを実行する方法はいくつかあります。いちばん一般的なのは、rubyというコマンドを使って実行する方法です。次によく使うのが、irbというコマンドを使って対話的に実行する方法です。小さいRubyプログラムの時は、irbコマンドを使う方が簡単に実行できます。
　ここではまずrubyコマンドを使う方法を紹介して、その後でirbコマンドを使う方法も紹介します。

# 各実行方法の違いについて言及している

　なお、Rubyそのものをインストールしていない人は、「付録A Ruby実行環境の準備」を見て、あらかじめインストールしておいてください。

# 付録Aについては割愛

＊注　本書で使用するRubyのバージョンは、Ruby2.3です。Mac OS XやLinuxを使用している場合、標準でインストールされているRubyのバージョンが古いことがあります。その場合、新しいRubyをインストールしてください。

# 動作環境についての注釈

*** 1.1.1. rubyコマンドを使う方法

　では、はじめて実行するプログラムList1.1を見てみましょう。

List1.1 helloruby.rb
 #+begin_src ruby
 print('Hello, Ruby.\n')
 #+end_src

# begin_srcからend_srcの間の記述はRubyで動作するプログラム

＊注　「\」（バックスラッシュ）は、Windowsでは「¥」（円記号）と表示されます。本書の中では、原則として「\」に統一します。

……ちょっと拍子抜けしたでしょうか？「プログラム」と聞いて、何かすごく長い暗号めいたものを想像されたかもしれませんが、このプログラムはたったの1行です。文字数にしても20字ちょっとしかありません。でも、これも立派なプログラムですし、実行すればちゃんと目的を果たします。
　このプログラムをエディタで入力し、ファイル名を「helloruby.rb」にして、ファイルとして保存してください。ファイル名の「.rb」は、Rubyのプログラムであることを表しています。

＊メモ　プログラムを入力するには、「エディタ」または「IDE」というソフトウェアを使います。エディタやIDEについては、「A.5 エディタとIDE」をご覧ください
# A.5は割愛

　それでは、このプログラムを実行してみましょう。コンソールを起動します。

＊メモ コンソールの起動方法については、「付録A Ruby実行環境の準備」でOS別に説明しています。

　コンソールを起動したら、ファイルhelloruby.rbを置いたフォルダに、cdコマンドで移動します。たとえばWindowsを使っていて、Cドライブのsrcフォルダ（c:\src）にファイルを置いたのであれば、次のように入力します。

# 以降、特に言及のない場合は「>」で始まるコマンドはコンソール上の操作とする

> cd c:\src

　そこで、

> ruby helloruby.rb

　と入力します。すると、例1.1のように、「Hello, Ruby.」と表示されます。

例1.1 rubyの起動

shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog> ruby helloruby.rb 
Hello, Ruby.
shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog>


＊メモ もしエラーが出てしまうようなら、第10章のコラム「エラーメッセージ」および「付録A Ruby実行環境の準備」を確認してください。
# 割愛

*** 1.1.2. irbコマンドを使う方法

　irbコマンドを使う方法も紹介します。
　irbコマンドは、rubyコマンドと同様にコンソールから実行します。ただし、プログラムを書いたファイルは指定しません。
　irbコマンドを実行すると、次のように入力プロンプトが表示されます

shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog> irb
irb(main):001:0> 

　ここで、先ほどのプログラムList1.1をそのまま入力し、[Enter]キーを押すと、その場で実行されます。

irb(main):001:0> print("Hello, Ruby.\n")
Hello, Ruby.  
=> nil
irb(main):002:0> 

# ２行目「Hello, Ruby.」が１行目のprintメソッドによって表示された文字列


＊メモ ３行目に表示される「=>nil」というのが、print文自体の戻り値です。詳しくは「7.3.1 メソッドの戻り値」で説明します。

　このように、入力したプログラムをその場で実行できるので、簡単なテストにはとても便利です。ただし、大きなプログラムを試すのには不向きなので、そのような場合にはrubyコマンドを使いましょう。
　irbコマンドを終了するに「exit」と入力して[Enter]キーを押すか、[Control]([Ctrl])キーを押しながら[d]キーを押します。

# irbコマンドは数行程度のごく簡単なプログラムを.rbプログラムで記述せずに直接打ち込み、その動作を確認できるコマンド。単純な動作確認の際に有用？

＊注　Mac OS XやWindowsを使っている場合、irbコマンドでは日本語が正しく入力できないことがあります。その場合、irbコマンドに--noreadlineオプションをつけて「irb --noreadline」と実行してください。これでreadline機能がオフになり、日本語を正しく入力できるようになります。ただし、readline機能をオフにすると、入力済みの文字の編集機能やヒストリ入力支援機能などが使えなくなってしまうので注意してください。

# irbコマンドに限らず、コンソール上で動作するほとんどのコマンドには、設定を変更できるオプションが存在する。オプションは一般的にコマンドの後に「-」や「--」と何らかの文字や文字列を記述することで動作する。

** 1.2. プログラムの解説
*** イントロダクション

　それでは、ほんの１行だけではありますが、List1.1のプログラムを解説しましょう。

*** 1.2.1. オブジェクト

#+begin_src ruby
print("Hello, Ruby.\n")
#+end_src

　まず、「"Hello, Ruby.\n"」という部分に注目します。

　これをStringオブジェクト、または文字列オブジェクト、あるいは単に文字列と呼びます。「Hello,Ruby.」という文字列を意味するオブジェクト、というわけです。

　Rubyでは、文字列、数値、時刻など様々なデータがオブジェクトになります。

# rubyはオブジェクト指向言語である


＊メモ 文字列の終わりの「\n」は改行を表す文字です。

*** 1.2.2. メソッド

#+begin_src ruby
print("Hello, Ruby.\n")
#+end_src

　今度はprintという部分に注目しましょう。

　「print」は、メソッドです。メソッドとは、オブジェクトを扱うための手続きのことです。「数値」を使って足し算や掛け算をしたり、「文字列」同士をつなげたり、「ある時刻」の１時間後や１日後を求めたりといったことは、すべてメソッドを起動することによって行われます。
　printメソッドは、「（）」のなかの内容をコンソールに出力するメソッドです。ですから、helloruby.rbでは、「Hello, Ruby.」という文字列オブジェクトが表示されています。
　メソッドに渡す情報のことを引数といいます。例えば、printメソッドの機能を説明する場合には「printメソッドは引数として与えられた文字列をコンソールに出力します」といった使い方をします。
　printメソッドの引数を書き換えて、別の文字列を表示するプログラムにしてみましょう。

helloruby_2.rb
#+begin_src ruby
print("Hello, RUBY!.\n")
#+end_src

　今度は大文字で「Hello,RUBY!」と表示するようになります。ちょっと元気の良いあいさつになりましたか？

** 1.3. 文字列
*** イントロダクション

　文字列について、もう少し詳しくもう少し見ていくことにしましょう。

