takahashi/docs/ruby_for_beginner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>はじめてのRuby</title>
<!-- 2018-07-25 水 12:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shun Takahashi" />
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/Users/bob/Github/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/default.min.css"></head>
<body>
<div id="content">
<h1 class="title">はじめてのRuby</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. はじめてのRuby</a>
<ul>
<li><a href="#sec-1-1">1.1. イントロダクション</a></li>
<li><a href="#sec-1-2">1.2. Rubyの実行方法</a>
<ul>
<li><a href="#sec-1-2-1">イントロダクション</a></li>
<li><a href="#sec-1-2-2">rubyコマンドを使う方法</a></li>
<li><a href="#sec-1-2-3">1.1.2. irbコマンドを使う方法</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. プログラムの解説</a>
<ul>
<li><a href="#sec-1-3-1">イントロダクション</a></li>
<li><a href="#sec-1-3-2">1.2.1. オブジェクト</a></li>
<li><a href="#sec-1-3-3">1.2.2. メソッド</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. 文字列</a>
<ul>
<li><a href="#sec-1-4-1">イントロダクション</a></li>
<li><a href="#sec-1-4-2">1.3.1. 改行文字と「\」</a></li>
<li><a href="#sec-1-4-3">1.3.2. 「''」と「""」</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. メソッドの呼び出し</a></li>
<li><a href="#sec-1-6">1.6. putsメソッド</a></li>
<li><a href="#sec-1-7">1.7. pメソッド</a></li>
<li><a href="#sec-1-8">1.8. 日本語の表示</a>
<ul>
<li><a href="#sec-1-8-1">コラム「日本語を扱う場合の注意」</a></li>
</ul>
</li>
<li><a href="#sec-1-9">1.9. 数値の表示と計算</a>
<ul>
<li><a href="#sec-1-9-1">イントロダクション</a></li>
<li><a href="#sec-1-9-2">1.8.1. 数値の表示</a></li>
<li><a href="#sec-1-9-3">1.8.2. 四則演算</a></li>
<li><a href="#sec-1-9-4">1.8.3. 数学的な関数</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10. 変数</a>
<ul>
<li><a href="#sec-1-10-1">1.9.1. printメソッドと変数</a></li>
</ul>
</li>
<li><a href="#sec-1-11">1.11. コメントを書く</a></li>
<li><a href="#sec-1-12">1.12. 制御構造</a>
<ul>
<li><a href="#sec-1-12-1">イントロダクション</a></li>
<li><a href="#sec-1-12-2">1.11.1. 制御構造の分類</a></li>
</ul>
</li>
<li><a href="#sec-1-13">1.13. 条件判断:if ~ then ~ end</a></li>
<li><a href="#sec-1-14">1.14. 繰り返し</a>
<ul>
<li><a href="#sec-1-14-1">イントロダクション</a></li>
<li><a href="#sec-1-14-2">while文</a></li>
<li><a href="#sec-1-14-3">timesメソッド</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 便利なオブジェクト</a>
<ul>
<li><a href="#sec-2-1">2.1. イントロダクション</a></li>
<li><a href="#sec-2-2">2.2. 配列（array）</a>
<ul>
<li><a href="#sec-2-2-1">イントロダクション</a></li>
<li><a href="#sec-2-2-2">2.1.1. 配列を作る</a></li>
<li><a href="#sec-2-2-3">2.1.2. 配列オブジェクト</a></li>
<li><a href="#sec-2-2-4">2.1.3.  配列からオブジェクトを取り出す</a></li>
<li><a href="#sec-2-2-5">2.1.4. 配列にオブジェクトを格納する</a></li>
<li><a href="#sec-2-2-6">2.1.5. 配列の中身</a></li>
<li><a href="#sec-2-2-7">2.1.6. 配列と大きさ</a></li>
<li><a href="#sec-2-2-8">2.1.7. 配列と繰り返し</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. ハッシュ（Hash）</a>
<ul>
<li><a href="#sec-2-3-1">2.2.1. シンボルとは</a></li>
<li><a href="#sec-2-3-2">2.2.2. ハッシュを作る</a></li>
<li><a href="#sec-2-3-3">2.2.3. ハッシュの操作</a></li>
<li><a href="#sec-2-3-4">2.2.4. ハッシュの繰り返し</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. 正規表現</a>
<ul>
<li><a href="#sec-2-4-1">2.3.1. パターンとマッチング</a></li>
<li><a href="#sec-2-4-2">コラム「nilとは？」</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. コマンドを作ろう</a>
<ul>
<li><a href="#sec-3-1">3.1. イントロダクション</a></li>
<li><a href="#sec-3-2">3.2. コマンドラインからのデータの入力</a></li>
<li><a href="#sec-3-3">3.3. ファイルからの読み込み</a>
<ul>
<li><a href="#sec-3-3-1">イントロダクション</a></li>
<li><a href="#sec-3-3-2">3.2.1. ファイルからテキストデータを読み込んで表示する</a></li>
<li><a href="#sec-3-3-3">3.2.2. ファイルからテキストデータを1行ずつ読み込んで表示する</a></li>
<li><a href="#sec-3-3-4">3.2.3. ファイルの中から特定のパターンの行のみを選んで出力する</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. メソッドの作成</a></li>
<li><a href="#sec-3-5">3.5. 別のファイルを取り込む</a>
<ul>
<li><a href="#sec-3-5-1">コラム「ppメソッド」</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>各実行方法(irb, file起動)の違いについて言及している，レジメ(report)にする．自分の独自のまとめをかく．．．．
</li>
<li>formatを調整する．c-c c-e hoでhtmlに打ち出す．
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> はじめてのRuby</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> イントロダクション</h3>
<div class="outline-text-3" id="text-1-1">
<p>
　それではRubyを使ってみましょう。
　この章では次の内容について紹介します。Rubyを使ったプログラミングの概要をつかんでください。
</p>

<ul class="org-ul">
<li>Rubyを使う- Rubyを使って、プログラムを実行してみます。
</li>
<li>文字や数値を使う- 文字や数値を出力したり、計算を行ったり、変数に代入したりします。
</li>
<li>条件判断や繰り返しを行う- 数値や文字列を比較して条件判断や、処理の繰り返しを行います。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Rubyの実行方法</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">イントロダクション</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
　まずは、画面に文字を表示するプログラムを作り、実行してみましょう。
</p>

<p>
　Rubyで書かれたプログラムを実行する方法はいくつかあります。いちばん一般的なのは、rubyというコマンドを使って実行する方法です。次によく使うのが、irbというコマンドを使って対話的に実行する方法です。小さいRubyプログラムの時は、irbコマンドを使う方が簡単に実行できます。
</p>

<p>
ここではまずrubyコマンドを使う方法を紹介して、その後でirbコマンドを使う方法も紹介します。
</p>



<p>
　なお、Rubyそのものをインストールしていない人は、「付録A Ruby実行環境の準備」を見て、あらかじめインストールしておいてください。
</p>

<ul class="org-ul">
<li>付録Aについては割愛
</li>

<li>注　本書で使用するRubyのバージョンは、Ruby2.3です。Mac OS XやLinuxを使用している場合、標準でインストールされているRubyのバージョンが古いことがあります。その場合、新しいRubyをインストールしてください。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">rubyコマンドを使う方法</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
　では、はじめて実行するプログラムList1.1を見てみましょう。
</p>

<p>
List1.1 helloruby.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">print('Hello, Ruby.\n')
</pre>
</div>

<p>
＊注　「\」（バックスラッシュ）は、Windowsでは「¥」（円記号）と表示されます。本書の中では、原則として「\」に統一します。
</p>

<p>
……ちょっと拍子抜けしたでしょうか？「プログラム」と聞いて、何かすごく長い暗号めいたものを想像されたかもしれませんが、このプログラムはたったの1行です。文字数にしても20字ちょっとしかありません。でも、これも立派なプログラムですし、実行すればちゃんと目的を果たします。
　このプログラムをエディタで入力し、ファイル名を「helloruby.rb」にして、ファイルとして保存してください。ファイル名の「.rb」は、Rubyのプログラムであることを表しています。
</p>

<p>
＊メモ　プログラムを入力するには、「エディタ」または「IDE」というソフトウェアを使います。エディタやIDEについては、「A.5 エディタとIDE」をご覧ください
</p>
<p>
　それでは、このプログラムを実行してみましょう。コンソールを起動します。
</p>

<p>
＊メモ コンソールの起動方法については、「付録A Ruby実行環境の準備」でOS別に説明しています。
</p>

<p>
　コンソールを起動したら、ファイルhelloruby.rbを置いたフォルダに、cdコマンドで移動します。たとえばWindowsを使っていて、Cドライブのsrcフォルダ（c:\src）にファイルを置いたのであれば、次のように入力します。
</p>

<p>
&gt; cd c:\src
</p>

<p>
　そこで、
</p>

<p>
&gt; ruby helloruby.rb
</p>

<p>
　と入力します。すると、例1.1のように、「Hello, Ruby.」と表示されます。
</p>

<p>
例1.1 rubyの起動
</p>

<p>
shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog&gt; ruby helloruby.rb 
Hello, Ruby.
shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog&gt;
</p>


<p>
＊メモ もしエラーが出てしまうようなら、第10章のコラム「エラーメッセージ」および「付録A Ruby実行環境の準備」を確認してください。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">1.1.2. irbコマンドを使う方法</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
　irbコマンドを使う方法も紹介します。
　irbコマンドは、rubyコマンドと同様にコンソールから実行します。ただし、プログラムを書いたファイルは指定しません。
　irbコマンドを実行すると、次のように入力プロンプトが表示されます
</p>

<p>
shun@MAC-no-MacBook-Air ~/g/m/t/r/sample_prog&gt; irb
irb(main):001:0&gt; 
</p>

<p>
　ここで、先ほどのプログラムList1.1をそのまま入力し、[Enter]キーを押すと、その場で実行されます。
</p>

<p>
irb(main):001:0&gt; print("Hello, Ruby.\n")
Hello, Ruby.  
=&gt; nil
irb(main):002:0&gt; 
</p>

<p>
＊メモ ３行目に表示される「=&gt;nil」というのが、print文自体の戻り値です。詳しくは「7.3.1 メソッドの戻り値」で説明します。
</p>

<p>
　このように、入力したプログラムをその場で実行できるので、簡単なテストにはとても便利です。ただし、大きなプログラムを試すのには不向きなので、そのような場合にはrubyコマンドを使いましょう。
　irbコマンドを終了するに「exit」と入力して[Enter]キーを押すか、[Control]([Ctrl])キーを押しながら[d]キーを押します。
</p>

<p>
＊注　Mac OS XやWindowsを使っている場合、irbコマンドでは日本語が正しく入力できないことがあります。その場合、irbコマンドに&#x2013;noreadlineオプションをつけて「irb &#x2013;noreadline」と実行してください。これでreadline機能がオフになり、日本語を正しく入力できるようになります。ただし、readline機能をオフにすると、入力済みの文字の編集機能やヒストリ入力支援機能などが使えなくなってしまうので注意してください。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> プログラムの解説</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">イントロダクション</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
　それでは、ほんの１行だけではありますが、List1.1のプログラムを解説しましょう。
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">1.2.1. オブジェクト</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-ruby">print("Hello, Ruby.\n")
</pre>
</div>

<p>
　まず、「"Hello, Ruby.\n"」という部分に注目します。
</p>

<p>
　これをStringオブジェクト、または文字列オブジェクト、あるいは単に文字列と呼びます。「Hello,Ruby.」という文字列を意味するオブジェクト、というわけです。
</p>

<p>
　Rubyでは、文字列、数値、時刻など様々なデータがオブジェクトになります。
</p>

<p>
＊メモ 文字列の終わりの「\n」は改行を表す文字です。
</p>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">1.2.2. メソッド</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-ruby">print("Hello, Ruby.\n")
</pre>
</div>

<p>
　今度はprintという部分に注目しましょう。
</p>

<p>
　「print」は、メソッドです。メソッドとは、オブジェクトを扱うための手続きのことです。「数値」を使って足し算や掛け算をしたり、「文字列」同士をつなげたり、「ある時刻」の１時間後や１日後を求めたりといったことは、すべてメソッドを起動することによって行われます。
　printメソッドは、「（）」のなかの内容をコンソールに出力するメソッドです。ですから、helloruby.rbでは、「Hello, Ruby.」という文字列オブジェクトが表示されています。
　メソッドに渡す情報のことを引数といいます。例えば、printメソッドの機能を説明する場合には「printメソッドは引数として与えられた文字列をコンソールに出力します」といった使い方をします。
　printメソッドの引数を書き換えて、別の文字列を表示するプログラムにしてみましょう。
</p>

<p>
helloruby_2.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">print("Hello, RUBY!.\n")
</pre>
</div>

<p>
　今度は大文字で「Hello,RUBY!」と表示するようになります。ちょっと元気の良いあいさつになりましたか？
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 文字列</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">イントロダクション</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
　文字列について、もう少し詳しくもう少し見ていくことにしましょう。
</p>
</div>
</div>
