takahashi/docs/ruby_for_beginner.org
*** 1.3.1. 改行文字と「\」

　先ほど、文字列の「\n」は改行を表すと説明しました。普通の文字を使って改行を書けるおかげで、たとえば

Hello,
Ruby
!

　と表示させるには、

#+begin_src ruby
print("Hello, \nRuby\n!\n")
#+end_src

　と書くことができます。もっとも、

#+begin_src ruby
print("Hello, 
Ruby
!
")
#+end_src

　などと書いても、同じように表示されます。しかし、この書き方だとプログラムが読みにくくなってしまうので、あまり良い書き方ではありません。せっかく改行を表す書き方があるのですから、それを使う方が良いでしょう。
　「\n」以外にも、文字列の中で特殊な文字を埋め込みたいときに「\」を使います。たとえば、「"」は文字列の始まりと終わりを表す文字ですが、これを文字列の中に含める場合には「\"」とします。


helloruby_3.rb
#+begin_src ruby
print("Hello, \"Ruby\".\n")
#+end_src

　上記のプログラムは、

Hello, "Ruby".

　と表示されます。
　このように、文字列中の「\」はそれに続く文字に特別な意味を与える文字になっています。そのため、「\」そのものを文字列中に含めたい時には、「\\」とかく必要があります。たとえば

#+begin_src ruby
print("Hello \\ Ruby!\n")
#+end_src

　上記のプログラムは、

Hello \ Ruby!

　と表示されます。２つあった「\」が１つになっていることに注意してください。

# 記載されているプログラムについて、同じような作業を繰り返すと判断した場合、sample_progには記載しないこととする


*** 1.3.2. 「''」と「""」

　文字列オブジェクトを作るための区切り文字には、「" "」（ダブルクォート）ではなく、「' '」（シングルクォート）を使うこともできます。先ほどのプログラムを

helloruby_4.rb
#+begin_src ruby
print('Hello,\nRuby\n!\n')
#+end_src

　とシングルクォートに書き換えて実行してみましょう。すると今度は

Hello,\nRuby\n!\n

　というように、「' '」の中の文字がそのまま表示されます。
　このように「' '」で囲った文字列は、「\n」などの特殊文字の解釈を行わず、そのまま表示します。ただし例外として、「\」と「'」を、文字列中に文字そのものとして含めたいときのみ、その文字の前に「\」をつけます。こんな感じです。

helloruby_5.rb
#+begin_src ruby
print('Hello, \\ \'Ruby\'.')
#+end_src

　実行すると次のように表示されます。

Hello, \ 'Ruby'.

# 「" "」と「' '」の違いは特殊な文字を表示する場合の記述の違いのみ。
# ２者間の違いを説明する場合に実例をまじえて説明すると違いがわかりやすい。

** 1.4. メソッドの呼び出し

　メソッドについてもう少し説明しましょう。
　Rubyのメソッドでは「（）」を省略することができます。そのため、先ほどのプログラム（List1.1）でのprintメソッドは、

helloruby_6.rb
#+begin_src ruby
print "Hello, Ruby.\n"
#+end_src

　と書くこともできます。
　また、いくつかの文字列を続けて表示したい時には、「,」で区切れば、並べた順に表示できます。ですから

#+begin_src ruby
print "Hello, ", "Ruby", ".", \n"
#+end_src

　なんて書き方もできるわけですね。これは、表示したいものがいくつもある時に使うと便利です。とはいえ、要素が複雑に込み入ってくると、「（）」をつけたほうがわかりやすくなります。慣れるまではこまめに「（）」を書いておきましょう。本書では、単純な場合には「（）」を書いて表記しています。
　さらに、メソッドを順に並べて書くと、その順にメソッドを実行します。例えば

helloruby_7.rb
#+begin_src ruby
print "Hello, "
print "Ruby"
print "."
print "\n"
#+end_src

　などと書いても、同じように「Hello,Ruby.」と表示するプログラムになります。

** 1.5. putsメソッド

　printメソッド以外にも文字列を表示するメソッドがあります。putsメソッドは、printメソッドとは異なり、表示する文字列の最後で必ず改行します。これを使えば、List1.1は


helloruby_8.rb
#+begin_src ruby
puts "Hello, Ruby."
#+end_src

　と書けるようになります。ただし、

#+begin_src ruby
puts "Hello, ", "Ruby!"
#+end_src

　のように２つの文字列を渡した場合には、

Hello, 
Ruby!

　と、それぞれの文字列の末尾に改行が追加されます。printメソッドとは少し使い勝手が違いますね。この２つのメソッドは、場面に応じて使い分けてください。

** 1.6. pメソッド

　さらにもう１つ、表示のためのメソッドを紹介しましょう。オブジェクトの内容を表示する時に便利な「p」というメソッドです。
　たとえば、数値の100と文字列の”"100"を、printメソッドやputsメソッドで表示させると、どちらも単に「100」と表示されてしまいます。これでは本当はどちらのオブジェクトなのか、表示結果から確認できません。そんな時には、pメソッドを使うのが便利です。pメソッドなら、文字列と数値を違った形で表示してくれるのです。さっそく試してみましょう。

puts "100" #=> 100
puts 100   #=> 100
p "100"    #=> "100"
p 100      #=> 100

＊メモ 本書では、プログラム中で出力した内容を表すために、出力用のメソッドの横に「#=>」という文字を置き、その右側に出力された文字を並べて書くという表記を用いています。この例では、「puts "100"」や「puts 100」、「p 100」というメソッドでは、「100」という文字列が出力され、「p "100"」というメソッドでは「"100"」という文字列が出力される、という意味になります。

# メモや注釈だけを折りたたみたい

　このように、文字列を出力する場合、「" "」で囲んで表示してくれるわけです。これなら一目瞭然ですね。さらに、文字列の中に含まれる改行やタブなどの特殊な文字も、「\n」や「\t」のように表示されます（List1.2)。

List1.2 puts_and_p.rb
#+begin_src ruby
puts "Hello,\n\tRuby."
p "Hello,\n\tRuby."
#+end_src

　実行例は以下のようになります。

> ruby puts_and_p.rb
Hello,
	Ruby.
"Hello,\n\tRuby."

　printメソッドは実行結果やメッセージなどを普通に表示したい時、pメソッドは実行中のプログラムの様子を確認したい時、と使い分ければ良いでしょう。原則として、pメソッドはプログラムを書いている人のためのメソッドなのです。

# ここまで、print,puts,p の３つのメソッドの違い、使い分け方について個別に言及している


# - 16:15 2018/7/21

** 1.7. 日本語の表示

# 13:00 2018/7/22 -

　ここまで、文字列にはアルファベット（英字）を使ってきました。
　今度は日本語を表示してみましょう。日本語の表示も難しい事は何もありません。単にアルファベットの代わりに日本語を「" "」の中に書くだけです。こんな感じになります。

List1.3 kiritsubo.rb
#+begin_src ruby
print "いづれの御時にか女御更衣あまたさぶらいたまいけるなかに\n"
print "いとなむごとなき際にはあらぬがすぐれて時めきたまふありけり\n"
#+end_src

　ただし、文字コードの設定によっては、エラーが出たり、正しく表示されない場合があります。その場合、コラム「日本語を扱う場合の注意」を参照してください。

*** コラム「日本語を扱う場合の注意」

　環境によっては、日本語を含むスクリプトを実行すると次のようなエラーになります。

実行例

> ruby kiritsubo.rb
kiritsubo.rb:1: invalid multibyte char (UTF-8)
kiritsubo.rb:1: invalid multibyte char (UTF-8)

　これはソースコードの文字コード（エンコーディング）が指定されていないからです。Rubyでは「# encoding: 文字コード」というコメントを１行目に記述することによってソースコードの文字コードを指定します（文字コードを決めるルールのことをエンコーディングと言います）。このコメントをマジックコメントと言います。
　Windowsで一般的に使われているエンコーディングShift_JISでソースコードを記述した場合は、次のようにマジックコメントを書きます。


#+begin_src ruby
# encoding: Shift_JIS
print "いづれの御時にか女御更衣あまたさぶらいたまいけるなかに\n"
print "いとなむごとなき際にはあらぬがすぐれて時めきたまふありけり\n"
#+end_src

　このようにコメントで文字コードを指定することによって、Rubyがソースコード中の日本語を正しく認識できるようになります。次の表にプラットフォームごとによく使われる文字コードをまとめています。複数の文字コード名が挙げられている場合は、環境に合わせて適切なものを選んでください。





　なお、マジックコメントがないソースコードの文字コードはUTF-8と仮定されます。そのため、UTF-8のソースコードを使う場合はマジックコメントは不要です。
　これ以外でも、前述のpメソッドで日本語の文字列を出力すると、いわゆる「文字化け」をしたような出力になる場合があります。そのような場合が、出力用の文字コードを指定するために「-E 文字コード」の形式でコマンドラインオプションを指定してください。コンソールがUTF-8を受け付ける場合は次のようにします。

実行例

> ruby -E UTF-8 スクリプトファイル名
> irb -E UTF-8

** 1.8. 数値の表示と計算

*** イントロダクション

　文字列に続いて、今度は「数値」を扱ってみましょう。Rubyのプログラムでは、整数や少数（浮動小数点数）を、自然な形で扱うことができます。

*** 1.8.1. 数値の表示

　まずは文字列の代わりに数値を表示するところから始めてみます。「1.2 プログラムの解説」で、「Rubyでは文字列は文字列オブジェクトという形になっている」と説明しました。同じように、数値も「数値オブジェクト」として扱われます。
　Rubyで整数オブジェクトを表現するのは簡単です。そのまま数字を書けば良いだけです。たとえば

1

　と書けば「1」の値の整数（Fixnum）オブジェクトになります。また、

100

　と書けば、「100」の値の整数オブジェクトになります。
　さらに、

3.1415

　などと書けば、「3.1415」の値の浮動小数点数（Float）オブジェクトになります。

＊メモ 「Fixnum」や「Float」というのは、それぞれのオブジェクトが所属する「クラス」の名前です。クラスについては、第4章と第8章で説明します。

　数値を表示するには、文字列と同様にprintメソッドやputsメソッドを使います。

puts(10)

　というメソッドを実行すると、

10

　と画面に表示されます。


*** 1.8.2. 四則演算

　数の計算を行ったり、その結果を表示したりすることもできます。四則演算をやってみましょう。
　ここではirbコマンドを使ってみます。

実行例

> irb --simple-prompt 
>> 1 + 1
=> 2
>> 2 - 3
=> -1
>> 5 * 10
=> 50
>> 100 / 4
=> 25

＊メモ irbコマンドの後の--simple-promptは、irbのプロンプト表示を簡易にするためのオプションです。

　プログラミング言語の世界では、掛け算の記号に「*」（アスタリスク）を、割り算の記号に「/」（スラッシュ）を使うのが一般的です。Rubyもこの習慣にならっています。
　もう少し四則演算をやってみましょう。普通の計算では、「足し算・引き算」と「掛け算・割り算」には計算の順序が決められていますが、Rubyでも同じです。つまり、

20 + 8 / 2

　とすれば答えは「24」になります。「20 + 8」を2で割りたいときは、「（）」で囲って、

(20 + 8) / 2

　とします。答えは「14」になります。


*** 1.8.3. 数学的な関数

　四則演算以外にも、平方根や、三角関数の「sin」「cos」、指数関数などの数学的な関数が利用できます。ただし、その場合、関数の前に「Math.」という文字列をつける必要があります。

＊メモ 「Math.」をつけずに「sin」「cos」などの関数を使うには、「include Math」という文が必要です。これについては「8.7.2 名前空間の提供」で説明します。

　sinはsinメソッド、平方根はsqrtメソッドで求めます。メソッドを実行すると、計算した結果を得ることができます。このことを「メソッドが値を返す」といい、得られる値のことを戻り値といいます。
# sqrt -> square root

実行例

> irb --simple-prompt 
>> Math.sin(3.1415)
=> 9.265358966049024e-05
>> Math.sqrt(10000)
=> 100.0

＊注　Rubyのバージョンや実行する環境により、結果の桁数などが異なる場合があります。

　１番目のsinの答えである「9.265358966049024e-05」ですが、これは、極端に大きい数や、極端に小さい数を表す時に使われる表記方法です。「（小数）0（整数）」と表示された時は、「（小数）*（10の（整数）乗）」の値、と解釈してください。この例の場合、「9.265358966049024×10の−5」ということになるの、つまりは0.00009265358966049024という値を表しています。

