takahashi/docs/ruby_for_beginner.html

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 変数</h3>
<div class="outline-text-3" id="text-1-10">
<p>
　プログラミングに欠かせない要素として変数があります。変数とは、「もの」につける名札のようなものです。
　オブジェクトに名札をつけるには、
</p>

<p>
変数名　= オブジェクト
</p>

<p>
　と書きます。このことを「変数にオブジェクトを代入するといいます。
</p>

<p>
例
</p>

<p>
alphabet = "abcdefg"
num = 10
age = 18
name = "TAKAHASHI"
</p>

<p>
　変数の利用例として、直方体の表面積と体積を求めるプログラム（List1.4）を見てみましょう。
</p>

<p>
List1.4 area_volume.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">x = 10
y = 20
z = 30
area = (x*y + y*z + z*x) * 2
volume = x * y * z
print "表面積=", area, "\n"
print "体積=", volume, "\n"
</pre>
</div>

<p>
　変数をまったく使わなければ、
</p>

<div class="org-src-container">

<pre class="src src-ruby">print "表面積=", (10+20 + 20*30 + 30*10) * 2, "\n"
print "体積=", 10*20*30, "\n"
</pre>
</div>

<p>
　といったプログラムになってしまいます。これでは値を1つ変更するために何箇所も修正しなければいけません。この例はたったの２行なので大したことはありませんが、ちょっと大きなプログラムになると、そのような変更をきちんと行うのは大変な手間となります。また、変数には、あたいが何をしているのかを明確にするという意味もあります。したがって、わかりやすい名前をつけることが大切です。例えば、
</p>


<div class="org-src-container">

<pre class="src src-ruby">hoge = (foo*bar + bar*baz + baz*foo) * 2
huni = foo * bar * baz
</pre>
</div>

<p>
　という調子では、何をやっているのかさっぱりわからないプログラムになってしまいます。変数名には、「area」や「volume」など、そのままで意味のわかる単語などを使うように、普段から心がけましょう。
</p>
</div>

<div id="outline-container-sec-1-10-1" class="outline-4">
<h4 id="sec-1-10-1">1.9.1. printメソッドと変数</h4>
<div class="outline-text-4" id="text-1-10-1">
<p>
　printメソッドの動きをもう少し見てみましょう。
</p>

<p>
print "表面積=", area, "\n"
</p>

<p>
　このprintメソッドの呼び出しには「"表面積="」「area」「"\n"」の3つの引数を指定しています。printメソッドはこれらの引数の値を順番に出力します。
　「"表面積="」は「表面=」という値を持った文字列なので、それがそのまま出力されます。「area」はareaという変数に関連づけられたオブジェクトになります。この例では2200という整数になっているので、printメソッドはその値を出力します。
　最後の「"\n"」は改行を表す文字列なので、そのまま出力します。
　これらの3つの値をprintメソッドで処理した結果として「表面積=2200」と改行が画面に表示されるというわけです。
　printメソッドに渡す文字列は次のように書くこともできます。
</p>

<p>
print "表面積=#{area}\n"
</p>

<p>
　「"表面積=#{area}\n"」が全体で1つの文字列になっています。「#{area}」は文字列の中に変数areaの値を埋め込むという書き方です。文字列の中に「#{変数名}」と書くと、文字列にデータを埋め込むことができます。計算結果の変数名を埋め込む代わりに、「"表面積=#{(x*y + y*z + z*x) * 2}\n"」のように計算式を直接描いても同じ結果を得られます。
　画面に結果を出力する場合は改行も出力することが多いため、putsメソッドを使って次のように書けば、「\n」も必要なくなり、プログラムがスッキリします。
</p>

<p>
puts "表面積=#{area}"
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> コメントを書く</h3>
<div class="outline-text-3" id="text-1-11">
<p>
　プログラムの中には、コメントを書くことができます。コメントは、プログラム中に書かれていても、直接プログラムとしては扱われません。つまり、プログラムの実行には何の関係もないもの、ということです。「どうしてプログラムの中に、実行とは関係のない余計なものを書くのだろう？」と思われるかもしれません。確かに一度書いて実行すればそれっきり、というプログラムであれば、コメントは特に必要ないでしょう。しかし、一度書いたプログラムを何度も使いまわすことも少なくありません。そのような時に、
</p>

<p>
・プログラムの名前や作者、配布条件などの情報
・プログラムの説明
</p>

<p>
　などを書いておくために、コメントが使われます。
　コメントを表す記号は「#」です。行頭に「#」があれば、１行まるまるコメントになります。行の途中に「#」があれば、「#」の部分から行末までがすべてコメントになります。また、行頭から始まる「=begin」と「=end」で囲まれた部分もコメントになります。これは、プログラムの先頭や最後で、長い説明を記しておくのに重宝します。
List1.5は、先ほどのList1.4にコメントを追加したプログラムです。
</p>

<p>
List1.5 comment_sample.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">=begin
「たのしいRuby 第５版」サンプル
コメントの使い方の例
2006/06/16 作成
2006/07/01 一部コメントを追加
2015/10/01 第5版に更新
=end
x = 10 # 横
y = 20 # 縦
z = 30 # 高さ
# 表面積と体積を計算する
area = (x*y + y*z + z*x) * 2
volume = x * y * z
# 出力する
print "表面積=", area, "\n"
print "体積=", volume, "\n"
</pre>
</div>

<p>
　なお、コメントは、先ほど挙げた目的以外にも、「この行の処理を一時的に実行させないようにする」といったことにも使います。
　C言語のコメントのように、行の途中だけをコメントにするような書き方はありません。行末まで必ずコメントになります。
</p>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> 制御構造</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1">イントロダクション</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
　プログラミング言語には、制御構造というものがあります。
　これは、何かの条件によって、プログラムの実行順序を変えたり、プログラムの一部を実行させなかったりするための仕掛けです。
</p>
</div>
</div>

<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2">1.11.1. 制御構造の分類</h4>
<div class="outline-text-4" id="text-1-12-2">
<p>
　制御構造を大雑把に分類すると次のようになります。
</p>

<p>
・逐次処理：プログラムを書かれた通りに、先頭から順に実行する。
・条件判断：ある条件が成り立つ場合は〇〇を、そうでない場合は××を実行する
・繰り返し：ある条件が成り立つ間、〇〇を繰り返し実行する
・例外処理：何か例外が発生した場合には、〇〇を実行する
</p>

<p>
　逐次処理というのは、通常の処理のことです。特に何も指定していない場合、プログラムは書かれた順に実行されます。
　条件判断は、条件に応じて処理が分岐します。条件が満たされない場合、書かれた処理の一部を飛ばして、実行が行われます。Rubyでは、if文やunless文、case文などが条件判断文になります。
　繰り返しは、条件に応じて、ある処理を何度も繰り返して実行することです。この場合、書かれた順序に逆らって、すでに一度実行されているところに戻って、再度実行が行われます。
　例外処理はやや特殊です。想定していない問題が発生した時、それまで実行していた部分を抜け出して、別の場所から実行を再開する処理です。場合によっては、そこでプログラムが終了してしまうこともあります。
　ここでは「条件判断」と「繰り返し」を取り上げます。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> 条件判断:if ~ then ~ end</h3>
<div class="outline-text-3" id="text-1-13">
<p>
　ある条件によって挙動が変わるプログラムを作るには、if文を使います。if文の構文は、次のようになります。
</p>

<p>
if 条件 then
  条件が成り立った時に実行したい処理
end
</p>

<p>
　条件には、値がtrueまたはfalseとなる式を書くのが一般的です。2つの値を比較して、一致すればtrue、一致しなければfalse、などが条件にあたります。
　数値の場合、例えば大小関係の比較には、等号や不等号を使います。Rubyでは、「=」は代入のための記号として使われるので、一致するかどうか調べるには「=」を2つ並べた記号「==」を使います。また、「≦」と「≧」には、「&lt;=」と「&gt;=」を使います。
　このような比較の結果はtrueまたはfalseとなります。もちろん、trueはその条件が成り立っている場合、falseは成り立っていない場合です。
</p>

<p>
p (2 <code>= 2)  #=&gt; true
p (1 =</code> 2)  #=&gt; false
p (3 &gt; 1)   #=&gt; true
p (3 &gt; 3)   #=&gt; false
p (3 &gt;= 3)  #=&gt; true
p (3 &lt; 1)   #=&gt; false
p (3 &lt; 3)   #=&gt; false
p (3 &lt;= 3)  #=&gt; true
</p>

<p>
　文字列の比較もできます。この場合も「==」を使います。同じ文字列ならtrue、異なる文字列ならfalseを返します。
</p>

<p>
p ("Ruby" <code>= "Ruby")    #=&gt;true
p ("Ruby" =</code> "Rubens")  #=&gt;false
</p>

<p>
　値が異なっていることを判断するには、「!=」を使います。これは「≠」の意味ですね。
</p>

<p>
p ("Ruby" != "Rubens")  #=&gt; true
p (1 != 1)              #=&gt; false
</p>

<p>
　では、これらを使って、条件判断文を書いてみましょう。変数aの値が10以上の場合は「greater」、９以下の場合は「smaller」と表示するプログラムはList1.6のようになります。
</p>

<p>
List1.6 greater_smaller.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">a = 20
if a &gt;= 10 then
  print "greater\n"
end
if a &lt;= 9 then
  print "smaller\n"
end
</pre>
</div>

<p>
　thenは省略することもできます。その場合、if文は次のようになります。
</p>

<p>
if a &gt;= 10
  print "greater\n"
end
</p>

<p>
　また、条件に一致するときとしないときで違う動作をさせたい場合は、else文を使います。次のような構文になります。
</p>

<p>
if 条件 then
  条件が成り立った時に実行したい処理
else
  条件が成り立たなかった時に実行したい処理
end
</p>

<p>
　これを使って、List1.6を書き直すと、List1.7のようになります。
</p>

<p>
List1.7 greater_smaller_else.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">a = 20
if a &gt;= 10
  print "greater\n"
else
  print "smaller\n"
end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> 繰り返し</h3>
<div class="outline-text-3" id="text-1-14">
</div><div id="outline-container-sec-1-14-1" class="outline-4">
<h4 id="sec-1-14-1">イントロダクション</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
　同じこと、または同じようなことを何度か繰り返したい場合があります。繰り返し処理を行う方法を2つ紹介しましょう。
</p>
</div>
</div>

<div id="outline-container-sec-1-14-2" class="outline-4">
<h4 id="sec-1-14-2">while文</h4>
<div class="outline-text-4" id="text-1-14-2">
<p>
　while文は、繰り返しを行うための基本的な構文です。なお、doは省略することもできます。
</p>

<p>
while 繰り返し続ける条件 do
  繰り返したい処理
end
</p>

<p>
例：1から10までの数を順番に表示する
</p>

<div class="org-src-container">

<pre class="src src-ruby">i = 1
while i &lt;= 10
  print i, "\n"
  i = i + 1
end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-14-3" class="outline-4">
<h4 id="sec-1-14-3">timesメソッド</h4>
<div class="outline-text-4" id="text-1-14-3">
<p>
　繰り返しの回数が決まっているときは、「times」というメソッドを使うとシンプルにできます。なお、こちらの「do」は省略できません。
</p>

<p>
繰り返す回数.times do
  繰り返したい処理
end
</p>

<p>
例：「All work and no play makes Jack a dull boy.」と100行表示する
</p>

<div class="org-src-container">

<pre class="src src-ruby">100.times do
  print "All work and no play makes Jack a dull boy.\n"
end
</pre>
</div>

<p>
　timesメソッドはイテレータと呼ばれるメソッドです。イテレータ（iterator）は、Rubyの特徴的な機能です。スペルからもわかるように「繰り返す（iterate）もの（-or）」という意味です。オペレータ（operator）が「演算（operate）するもの」として「演算子」と呼ばれるのを真似るなら、さしずめ「繰り返し子」「反復子」というところでしょうか。その名の通り、繰り返しを行うためのメソッドです。
　Rubyはtimesメソッド以外にも数多くのイテレータを提供しています。イテレータの代表はeachメソッドです。eachメソッドについては、第２章で配列やハッシュと一緒に紹介します。
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 便利なオブジェクト</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> イントロダクション</h3>
<div class="outline-text-3" id="text-2-1">
<p>
　第１章では、Rubyで扱う基本的なデータとして「文字列」と「数値」を取り上げましたが、Rubyで扱えるオブジェクトはこれだけではありません。多くのRubyのプログラムでは、もっと複雑なデータを扱うことになるでしょう。
　Rubyでアドレス帳を作ることを考えてみます。アドレス帳に必要な項目は、
</p>

<p>
・名前　　　　・電話番号
・ふりがな　　・メールアドレス
・郵便番号　　・SNSのID
・住所　　　　・登録日
</p>

<p>
といったところでしょうか。これらはいずれも文字列で表現できそうです。
　これらの項目をひとまとめにすることで、１人分の情報になります。さらに、交友関係の人たちの情報が集まって、アドレス帳全体のデータが出来上がるわけです。
</p>


<p>
　このようにデータとデータを合わせた1つのデータを表すには、これまでに紹介した「文字列」や「数値」といった単純なオブジェクト以外に、データの集まりを表現するデータ構造が必要になります。
　この章では、「配列」と「ハッシュ」というデータ構造を紹介します。また、「正規表現」という、文字列処理に使われるオブジェクトも紹介します。
</p>

<p>
＊メモ 配列やハッシュのようにオブジェクトを格納するオブジェクトを、コンテナやコレクションと言います。
</p>

<p>
　配列・ハッシュ・正規表現はさまざまな場面で使われますが、より詳しい説明は後の章で行うことにして、ここではごく大まかにイメージをつかむことを目的に解説します。
</p>
</div>
</div>
