takahashi/docs/ruby_for_beginner.org
*** イントロダクション

　配列は「いくつかのオブジェクトを順序付きで格納したオブジェクト」として、もっとも基本的でよく使われるコンテナです。「配列オブジェクト」「Arrayオブジェクト」などと呼ばれることもあります。

*** 2.1.1. 配列を作る

　新しい配列を作るには、要素をカンマ区切りで並べて、「[]」で全体を囲みます。まずは簡単な、文字列の配列を作ってみましょう。

names = ["小林", "林", "高野", "森岡"]

　この例では、namesという配列オブジェクトが作られました。各要素として「"小林"」「"林"」「"高野"」「"森岡"」という4つの文字列を格納しています。

*** 2.1.2. 配列オブジェクト

　配列の要素となるオブジェクトが決まっていない場合には、「[]」とだけ書くと、空の配列オブジェクトができます。

names = []

　これ以外にも配列の作り方はいくつかあります。詳しくは「第１３章　配列
（Array）クラス」で説明します。

*** 2.1.3.  配列からオブジェクトを取り出す

　配列に格納されたオブジェクトには、位置を表す番号であるインデックスがつきます。このインデックスを使って、オブジェクトを格納したり、取り出したりできます。
　配列の要素を取り出すには、

配列名[インデックス]

という構文を使います。例えば、namesという名前の配列オブジェクトを次のように作ったとします。

names = ["小林", "林", "高野", "森岡"]

　配列namesの最初の要素である「小林」という文字列を取り出すには、

names[0]

と書きます。そのため、

print "最初の名前は", names[0], "です。\n"

という文を実行すると、

最初の名前は小林です。

と表示されます。同様に、names[1]は"林"、names[2]は"高野"になります。

実行例

> irb --simple-prompt
>> names = ["小林", "林", "高野", "森岡"]
=> ["小林", "林", "高野", "森岡"]
>> names[0]
=> "小林"
>> names[1]
=> "林"
>> names[2]
=> "高野"
>> names[3]
=> "森岡"
＊メモ 配列のインデックスは0から始まります。１ではありません。ですから、a[1]と書くと、aという配列オブジェクトの先頭の要素ではなく、２番目の要素が返ってきます。慣れるまでは間違いやすいかもしれません（慣れていても間違いやすいところです）。注意してください。

＊注　Windowsのコマンドプロンプトで日本語入力モードに切り替えるには、[半角/全角]キーを押します。

*** 2.1.4. 配列にオブジェクトを格納する

　すでにある配列に、新しいオブジェクトを格納することもできます。
　配列の要素の1つを別のオブジェクトと置き換えるには、

配列名[インデックス] = 格納したいオブジェクト

という構文を使います。先ほどの配列namesを使ってみましょう。先頭に"野尻"という文字列を格納するには、

names[0] = "野尻"

と書きます。例えば、次のように実行すると、namesの最初の要素が「野尻」になることがわかります。

実行例

> irb --simple-prompt
>> names = ["小林", "林", "高野", "森岡"]
=> ["小林", "林", "高野", "森岡"]
>> names[0] = "野尻"
=> "野尻"
>> names
=> ["野尻", "林", "高野", "森岡"]

　オブジェクトの格納先として、オブジェクトのまだ存在しない位置を指定すると、配列の大きさが変わります。Rubyの配列は、必要に応じて自動的に大きくなります。

実行例

> irb --simple-prompt
>> names = ["小林", "林", "高野", "森岡"]
=> ["小林", "林", "高野", "森岡"]
>> name[4] = "野尻"
=> "野尻"
>> names
=> ["小林", "林", "高野", "森岡", "野尻"]

*** 2.1.5. 配列の中身

　配列の中には、どんなオブジェクトも要素として格納できます。例えば、文字列ではなく数値の配列も作れます。

num = [3, 1, 4, 1, 5, 9, 2, 6, 5]

　1つの配列の中に、複数の種類のオブジェクトを混ぜることもできます。

mixed = [1, "歌", 2, "風", 3]

　ここでは例を挙げませんが、「時刻」や「ファイル」といったオブジェクトも、配列の要素にできます。

*** 2.1.6. 配列と大きさ

　配列の大きさを得るには、sizeメソッドを使います。例えば、配列arrayに対して次のように使います。

array.size

　sizeメソッドを使って、先ほどの配列オブジェクトnamesの大きさを調べてみましょう。

実行例

> irb --simple-prompt
>> names = ["小林", "林", "高野", "森岡"]
=> ["小林", "林", "高野", "森岡"]
>> names.size
=> 4

　このように、配列の大きさが、数値として返ってきます。

*** 2.1.7. 配列と繰り返し

「配列の要素をすべて表示したい」とか、「配列の要素のうち、ある条件に当てはまる要素についてはxxメソッドを、当てはまらない要素についてはyyメソッドを適用したい」といったときには、配列の要素すべてにアクセスする方法が必要です。
　Rubyには、このためのメソッドとして、eachメソッドが用意されています。eachメソッドは、第１章でも少し触れたように「イテレータ」というメソッドの1つです。
　eachメソッドは、次のように使います。

配列.each do |変数|
  繰り返したい処理
end

　eachのすぐ後ろの「do ~ end」で囲まれている部分をブロックといいます。そのため、eachのようなメソッドは、ブロックつきメソッドとも呼ばれます。ブロックにはいくつかの処理をまとめて記述することができます。
　ブロックの冒頭には「|変数|」という部分があります。eachメソッドは、配列から要素を１つずつ取り出して、「|変数|」で指定された変数に代入して、ブロックの中のメソッドを繰り返し実行していきます。
　実際に使ってみましょう。配列namesにあるすべての要素を順番に表示してみます。

実行例

> irb --simple-prompt
>> names = ["小林", "林", "高野", "森岡"]
=> ["小林", "林", "高野", "森岡"]
>> names.each do |n|   # do~endのように複数行にまたがる場合、
?>   puts n              endが入力されるまで実行されません
>> end
小林   # putsメソッドの実行結果
林
高野
森岡
=> ["小林", "林", "高野", "森岡"] 　# eachメソッドの戻り値

　|n|となっている部分の変数nには、繰り返しの度に配列namesの要素が代入されます。


　配列にはeachメソッドの他にもブロックを使うメソッドがたくさん用意されています。配列の要素をまとめて処理する場合によく使います。詳しくは「13.6 配列の主なメソッド」で取り上げます。

# 15:10

** 2.2. ハッシュ（Hash）

　ハッシュ（Hash）もよく使われるコンテナです。ハッシュでは文字列やシンボルなどをキーにしてオブジェクトを格納します。

address = {name: "高橋"m furigana: "タカハシ", postal: "1234567"}

*** 2.2.1. シンボルとは

　シンボル（Symbol）というのは、文字列に似たオブジェクトで、Rubyがメソッドなどの名前を識別するためのラベルをオブジェクトにしたものです。
　シンボルは、先頭に「:」をつけて表現します。

sym = :foo    # これがシンボル「:foo」を表す
sym2 = :"foo" # 上と同じ意味

　シンボルと同様のことは大抵文字列でもできます。ハッシュのキーのように単純に「同じかどうか」を比較するような場合は、文字列よりも効率が良いことが多いので、シンボルがよく使われます。

　なお、シンボルと文字列はそれぞれ互いに変換できます。シンボルにto_sメソッドを使えば、対応する文字列を取り出せます。逆に、文字列にto_symメソッドを使えば、対応するシンボルを得られます。

実行例

> irb --simple-prompt
>> sym = :foo
=> :foo
>> sum.to_s      # シンボルを文字列に変換
=> "foo"
>> "foo".to_sym  # 文字列をシンボルに変換
=> :foo


*** 2.2.2. ハッシュを作る
　新しいハッシュの作り方は、配列の作り方にちょっと似ています。配列と違うのは、「[]」の代わりに「{}」で囲むところです。また、ハッシュでは、オブジェクトを取り出すためのキーと、そのキーと対応させるオブジェクトを「キー => オブジェクト」という形式で指定します。キーにはシンボル、文字列、数理がよく使われます。

song = { :title => "Paranoid Android", :artist => "Radiohead" }
person = { "名前" => "高橋", "仮名" => "タカハシ" }
mark = { 11 => "Jack", 12 => "Queen", 13 => "King" }

　とりわけシンボルがよく用いられるため、専用の短い書き方が用意されています。次の２つは同じ意味です。

person1 = { :name => "後藤", :kana => "ゴトウ" }
person2 = { name: "後藤", kana: "ゴトウ" }

*** 2.2.3. ハッシュの操作

　ハッシュからオブジェクトを取り出したり、オブジェクトを格納したりする方法も、配列にそっくりです。ハッシュに格納されたオブジェクトを取り出すには、次の構文を使います。

ハッシュ名[キー]

　また、オブジェクトを格納するには次の構文を使います。

ハッシュ名[キー] = 格納したいオブジェクト

　配列と違って、キーには数値以外のオブジェクトも使えます。シンボルをキーにしたハッシュを操作してみましょう。

実行例

> irb --simple-prompt
>> address = {name: = "高橋", furigana: "タカハシ"}
=> {:name=>"高橋", :furigana=>"タカハシ"}
>> address{:name}
=> "高橋"
>> address{:furigana}
=> "タカハシ"
>> address{:tel} = "000-1234-5678"
=> "000-1234-5678"
>> address
=> {:name=>"高橋", :furigana=>"タカハシ", :tel=>"000-1234-5678"}

*** 2.2.4. ハッシュの繰り返し

　eachメソッドを使って、ハッシュのキーと値を１つずつ取り出し、すべての要素を処理することができます。配列の場合はインデックスの順に要素を取り出しましたが、ハッシュの場合は「キー」と「値」の組を取り出すことになります。
　ハッシュ用のeachは次のように書きます。

ハッシュ.each do |キーの変数, 値の変数|
  繰り返したい処理
end

早速使ってみましょう。

実行例

> irb --simple-prompt
>> address = {name: = "高橋", furigana: "タカハシ"}
=> {:name=>"高橋", :furigana=>"タカハシ"}
>> address.each do |key, value|
?>   puts "#{key}: #{value}"
>> end
name: 高橋
furigana: タカハシ
=> {:name=>"高橋", :furigana=>"タカハシ"}

　eachメソッドによって、ハッシュaddressが持っている項目名とその値を表示するputsメソッドが繰り返し実行されるのがわかります。

** 2.3. 正規表現

　Rubyで文字列を処理するときには、正規表現（Regular Expression）というものがよく使われます。正規表現を使うと、

・文字列とパターンの一致（マッチング）
・パターンを使った文字列の切り出し

などを手軽に行えます。
　正規表現は、PerlやPythonなど、Rubyの先輩格にあたるスクリプト言語で培われてきた機能です。Rubyもその流れを受け継いでいて、言語に組み込みの機能として、手軽に正規表現を扱えます。文字列処理はRubyの得意分野ですが、それはこの正規表現のおかげでもあります。

