takahashi/docs/ruby_for_beginner.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 配列（array）</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">イントロダクション</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
　配列は「いくつかのオブジェクトを順序付きで格納したオブジェクト」として、もっとも基本的でよく使われるコンテナです。「配列オブジェクト」「Arrayオブジェクト」などと呼ばれることもあります。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">2.1.1. 配列を作る</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
　新しい配列を作るには、要素をカンマ区切りで並べて、「[]」で全体を囲みます。まずは簡単な、文字列の配列を作ってみましょう。
</p>

<p>
names = ["小林", "林", "高野", "森岡"]
</p>

<p>
　この例では、namesという配列オブジェクトが作られました。各要素として「"小林"」「"林"」「"高野"」「"森岡"」という4つの文字列を格納しています。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">2.1.2. 配列オブジェクト</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
　配列の要素となるオブジェクトが決まっていない場合には、「[]」とだけ書くと、空の配列オブジェクトができます。
</p>

<p>
names = []
</p>

<p>
　これ以外にも配列の作り方はいくつかあります。詳しくは「第１３章　配列
（Array）クラス」で説明します。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">2.1.3.  配列からオブジェクトを取り出す</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
　配列に格納されたオブジェクトには、位置を表す番号であるインデックスがつきます。このインデックスを使って、オブジェクトを格納したり、取り出したりできます。
　配列の要素を取り出すには、
</p>

<p>
配列名[インデックス]
</p>

<p>
という構文を使います。例えば、namesという名前の配列オブジェクトを次のように作ったとします。
</p>

<p>
names = ["小林", "林", "高野", "森岡"]
</p>

<p>
　配列namesの最初の要素である「小林」という文字列を取り出すには、
</p>

<p>
names<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
と書きます。そのため、
</p>

<p>
print "最初の名前は", names<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>, "です。\n"
</p>

<p>
という文を実行すると、
</p>

<p>
最初の名前は小林です。
</p>

<p>
と表示されます。同様に、names<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>は"林"、names<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>は"高野"になります。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; names = ["小林", "林", "高野", "森岡"]
=&gt; ["小林", "林", "高野", "森岡"]
&gt;&gt; names<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>
=&gt; "小林"
&gt;&gt; names<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>
=&gt; "林"
&gt;&gt; names<sup><a id="fnr.3.100" name="fnr.3.100" class="footref" href="#fn.3">3</a></sup>
=&gt; "高野"
&gt;&gt; names<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>
=&gt; "森岡"
＊メモ 配列のインデックスは0から始まります。１ではありません。ですから、a<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>と書くと、aという配列オブジェクトの先頭の要素ではなく、２番目の要素が返ってきます。慣れるまでは間違いやすいかもしれません（慣れていても間違いやすいところです）。注意してください。
</p>

<p>
＊注　Windowsのコマンドプロンプトで日本語入力モードに切り替えるには、[半角/全角]キーを押します。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">2.1.4. 配列にオブジェクトを格納する</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
　すでにある配列に、新しいオブジェクトを格納することもできます。
　配列の要素の1つを別のオブジェクトと置き換えるには、
</p>

<p>
配列名[インデックス] = 格納したいオブジェクト
</p>

<p>
という構文を使います。先ほどの配列namesを使ってみましょう。先頭に"野尻"という文字列を格納するには、
</p>

<p>
names<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> = "野尻"
</p>

<p>
と書きます。例えば、次のように実行すると、namesの最初の要素が「野尻」になることがわかります。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; names = ["小林", "林", "高野", "森岡"]
=&gt; ["小林", "林", "高野", "森岡"]
&gt;&gt; names<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> = "野尻"
=&gt; "野尻"
&gt;&gt; names
=&gt; ["野尻", "林", "高野", "森岡"]
</p>

<p>
　オブジェクトの格納先として、オブジェクトのまだ存在しない位置を指定すると、配列の大きさが変わります。Rubyの配列は、必要に応じて自動的に大きくなります。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; names = ["小林", "林", "高野", "森岡"]
=&gt; ["小林", "林", "高野", "森岡"]
&gt;&gt; name<sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup> = "野尻"
=&gt; "野尻"
&gt;&gt; names
=&gt; ["小林", "林", "高野", "森岡", "野尻"]
</p>
</div>
</div>

<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">2.1.5. 配列の中身</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
　配列の中には、どんなオブジェクトも要素として格納できます。例えば、文字列ではなく数値の配列も作れます。
</p>

<p>
num = [3, 1, 4, 1, 5, 9, 2, 6, 5]
</p>

<p>
　1つの配列の中に、複数の種類のオブジェクトを混ぜることもできます。
</p>

<p>
mixed = [1, "歌", 2, "風", 3]
</p>

<p>
　ここでは例を挙げませんが、「時刻」や「ファイル」といったオブジェクトも、配列の要素にできます。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7">2.1.6. 配列と大きさ</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
　配列の大きさを得るには、sizeメソッドを使います。例えば、配列arrayに対して次のように使います。
</p>

<p>
array.size
</p>

<p>
　sizeメソッドを使って、先ほどの配列オブジェクトnamesの大きさを調べてみましょう。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; names = ["小林", "林", "高野", "森岡"]
=&gt; ["小林", "林", "高野", "森岡"]
&gt;&gt; names.size
=&gt; 4
</p>

<p>
　このように、配列の大きさが、数値として返ってきます。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-8" class="outline-4">
<h4 id="sec-2-2-8">2.1.7. 配列と繰り返し</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
「配列の要素をすべて表示したい」とか、「配列の要素のうち、ある条件に当てはまる要素についてはxxメソッドを、当てはまらない要素についてはyyメソッドを適用したい」といったときには、配列の要素すべてにアクセスする方法が必要です。
　Rubyには、このためのメソッドとして、eachメソッドが用意されています。eachメソッドは、第１章でも少し触れたように「イテレータ」というメソッドの1つです。
　eachメソッドは、次のように使います。
</p>

<p>
配列.each do |変数|
  繰り返したい処理
end
</p>

<p>
　eachのすぐ後ろの「do ~ end」で囲まれている部分をブロックといいます。そのため、eachのようなメソッドは、ブロックつきメソッドとも呼ばれます。ブロックにはいくつかの処理をまとめて記述することができます。
　ブロックの冒頭には「|変数|」という部分があります。eachメソッドは、配列から要素を１つずつ取り出して、「|変数|」で指定された変数に代入して、ブロックの中のメソッドを繰り返し実行していきます。
　実際に使ってみましょう。配列namesにあるすべての要素を順番に表示してみます。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; names = ["小林", "林", "高野", "森岡"]
=&gt; ["小林", "林", "高野", "森岡"]
&gt;&gt; names.each do |n|   # do~endのように複数行にまたがる場合、
?&gt;   puts n              endが入力されるまで実行されません
&gt;&gt; end
小林   # putsメソッドの実行結果
林
高野
森岡
=&gt; ["小林", "林", "高野", "森岡"] 　# eachメソッドの戻り値
</p>

<p>
　|n|となっている部分の変数nには、繰り返しの度に配列namesの要素が代入されます。
</p>


<p>
　配列にはeachメソッドの他にもブロックを使うメソッドがたくさん用意されています。配列の要素をまとめて処理する場合によく使います。詳しくは「13.6 配列の主なメソッド」で取り上げます。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ハッシュ（Hash）</h3>
<div class="outline-text-3" id="text-2-3">
<p>
　ハッシュ（Hash）もよく使われるコンテナです。ハッシュでは文字列やシンボルなどをキーにしてオブジェクトを格納します。
</p>

<p>
address = {name: "高橋"m furigana: "タカハシ", postal: "1234567"}
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">2.2.1. シンボルとは</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
　シンボル（Symbol）というのは、文字列に似たオブジェクトで、Rubyがメソッドなどの名前を識別するためのラベルをオブジェクトにしたものです。
　シンボルは、先頭に「:」をつけて表現します。
</p>

<p>
sym = :foo    # これがシンボル「:foo」を表す
sym2 = :"foo" # 上と同じ意味
</p>

<p>
　シンボルと同様のことは大抵文字列でもできます。ハッシュのキーのように単純に「同じかどうか」を比較するような場合は、文字列よりも効率が良いことが多いので、シンボルがよく使われます。
</p>

<p>
　なお、シンボルと文字列はそれぞれ互いに変換できます。シンボルにto_sメソッドを使えば、対応する文字列を取り出せます。逆に、文字列にto_symメソッドを使えば、対応するシンボルを得られます。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; sym = :foo
=&gt; :foo
&gt;&gt; sum.to_s      # シンボルを文字列に変換
=&gt; "foo"
&gt;&gt; "foo".to_sym  # 文字列をシンボルに変換
=&gt; :foo
</p>
</div>
</div>


<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">2.2.2. ハッシュを作る</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
　新しいハッシュの作り方は、配列の作り方にちょっと似ています。配列と違うのは、「[]」の代わりに「{}」で囲むところです。また、ハッシュでは、オブジェクトを取り出すためのキーと、そのキーと対応させるオブジェクトを「キー =&gt; オブジェクト」という形式で指定します。キーにはシンボル、文字列、数理がよく使われます。
</p>

<p>
song = { :title =&gt; "Paranoid Android", :artist =&gt; "Radiohead" }
person = { "名前" =&gt; "高橋", "仮名" =&gt; "タカハシ" }
mark = { 11 =&gt; "Jack", 12 =&gt; "Queen", 13 =&gt; "King" }
</p>

<p>
　とりわけシンボルがよく用いられるため、専用の短い書き方が用意されています。次の２つは同じ意味です。
</p>

<p>
person1 = { :name =&gt; "後藤", :kana =&gt; "ゴトウ" }
person2 = { name: "後藤", kana: "ゴトウ" }
</p>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3">2.2.3. ハッシュの操作</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
　ハッシュからオブジェクトを取り出したり、オブジェクトを格納したりする方法も、配列にそっくりです。ハッシュに格納されたオブジェクトを取り出すには、次の構文を使います。
</p>

<p>
ハッシュ名[キー]
</p>

<p>
　また、オブジェクトを格納するには次の構文を使います。
</p>

<p>
ハッシュ名[キー] = 格納したいオブジェクト
</p>

<p>
　配列と違って、キーには数値以外のオブジェクトも使えます。シンボルをキーにしたハッシュを操作してみましょう。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; address = {name: = "高橋", furigana: "タカハシ"}
=&gt; {:name=&gt;"高橋", :furigana=&gt;"タカハシ"}
&gt;&gt; address{:name}
=&gt; "高橋"
&gt;&gt; address{:furigana}
=&gt; "タカハシ"
&gt;&gt; address{:tel} = "000-1234-5678"
=&gt; "000-1234-5678"
&gt;&gt; address
=&gt; {:name=&gt;"高橋", :furigana=&gt;"タカハシ", :tel=&gt;"000-1234-5678"}
</p>
</div>
</div>

<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4">2.2.4. ハッシュの繰り返し</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
　eachメソッドを使って、ハッシュのキーと値を１つずつ取り出し、すべての要素を処理することができます。配列の場合はインデックスの順に要素を取り出しましたが、ハッシュの場合は「キー」と「値」の組を取り出すことになります。
　ハッシュ用のeachは次のように書きます。
</p>

<p>
ハッシュ.each do |キーの変数, 値の変数|
  繰り返したい処理
end
</p>

<p>
早速使ってみましょう。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; address = {name: = "高橋", furigana: "タカハシ"}
=&gt; {:name=&gt;"高橋", :furigana=&gt;"タカハシ"}
&gt;&gt; address.each do |key, value|
?&gt;   puts "#{key}: #{value}"
&gt;&gt; end
name: 高橋
furigana: タカハシ
=&gt; {:name=&gt;"高橋", :furigana=&gt;"タカハシ"}
</p>

<p>
　eachメソッドによって、ハッシュaddressが持っている項目名とその値を表示するputsメソッドが繰り返し実行されるのがわかります。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 正規表現</h3>
<div class="outline-text-3" id="text-2-4">
<p>
　Rubyで文字列を処理するときには、正規表現（Regular Expression）というものがよく使われます。正規表現を使うと、
</p>

<p>
・文字列とパターンの一致（マッチング）
・パターンを使った文字列の切り出し
</p>

<p>
などを手軽に行えます。
　正規表現は、PerlやPythonなど、Rubyの先輩格にあたるスクリプト言語で培われてきた機能です。Rubyもその流れを受け継いでいて、言語に組み込みの機能として、手軽に正規表現を扱えます。文字列処理はRubyの得意分野ですが、それはこの正規表現のおかげでもあります。
</p>
</div>
