takahashi/docs/ruby_for_beginner.html

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1">2.3.1. パターンとマッチング</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
「〇〇という文字列を含んだ行を表示したい」とか、「〇〇と××の間に書かれた文字列を抜き出したい」などといった、特定の文字列のパターンに対する処理を行いたい場合があります。文字列がパターンに当てはまるかどうかを調べることをマッチングといい、パターンに当てはまることを「マッチする」といいます。
　このような文字列のパターンをプログラミング言語で表現するために使われるのが、正規表現です。
</p>

<p>
マッチングの例
</p>

<p>
<i>cde</i> =~ "abcdefg"
</p>


<p>
「正規表現」という言葉から、何やら難しげな雰囲気が漂う、硬そうな印象を持たれるかもしれません。実際のところ正規表現の世界は何かと奥が深いのですが、単純なマッチングに使う分にはあまり身構える必要はありません。まずは、そういうものがあるということを覚えておいてください。
　正規表現オブジェクトを作るための構文は、次の通りです。
</p>

<p>
<i>パターン</i>
</p>

<p>
　例えば「Ruby」という文字列にマッチする正規表現は、
</p>

<p>
<i>Ruby</i>
</p>

<p>
と書きます。そのままですね。アルファベットと数字からなる文字列に一致するパターンを書く分には、「そのまま」で大丈夫です。
　正規表現と文字列のマッチングを行うためには、「=~」演算子を使います。同じオブジェクト同士が等しいかどうかを調べる「==」に似ています。
　正規表現と文字列のマッチングを行うには、
</p>

<p>
<i>パターン</i> =~ マッチングしたい文字列
</p>

<p>
と書きます。英数字や漢字だけのパターンを使った場合は、パターンの文字列を含んでいればマッチし、含んでいなければマッチしません。マッチングが成功した時は、マッチ部分の位置を返します。文字の位置は、配列のインデックスと同様に、0から数えます。つまり、先頭文字の位置は0と表されます。一方、マッチングが失敗だとnilを返します。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; <i>Ruby</i> =~ "Yet Another Ruby Hacker,"
=&gt; 12
&gt;&gt; <i>Ruby</i> =~ "Ruby"
=&gt; 0
&gt;&gt; <i>Ruby</i> =~ "Diamond"
=&gt;nil
</p>

<p>
　正規表現の右側の「/」に続けて「i」とかいた場合には、英字の大文字・小文字を区別せずにマッチングを行うようになります。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; <i>Ruby</i> =~ "ruby"
=&gt; nil
&gt;&gt; <i>Ruby</i> =~ "RUBY"
=&gt; nil
&gt;&gt; /Ruby/i =~ "ruby"
=&gt; 0
&gt;&gt; /Ruby/i =~ "RUBY"
=&gt; 0
&gt;&gt; /Ruby/i =~ "rUbY"
=&gt; 0
</p>

<p>
　これ以外にも、正規表現には数々の書き方や使い方があります。詳しくは「第１６章　正規表現（Regexp）クラス」で説明します。
</p>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2">コラム「nilとは？」</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
　nilはオブジェクトが存在しないことを表す特別な値です。正規表現によるマッチングの際に、どこにもマッチしなかったことを表す場合のように、メソッドが意味のある値を返すことができないときにはnilが返されます。また、配列やハッシュからデータを取り出す場合に、まだ存在していないインデックスやキーを指定すると次のようにnilが得られます。
</p>

<p>
実行例
</p>

<p>
&gt; irb &#x2013;simple-prompt
&gt;&gt; item = {"name"=&gt;"ブレンド", "price"=&gt;610}
=&gt; {"name"=&gt;"ブレンド", "price"=&gt;610}
&gt;&gt; item{"tax"}
=&gt; nil
</p>

<p>
　if文やwhile文は、条件を判定するときにfalseとnilを「偽」の値として扱い、それ以外の全ての値を「真」として扱います。したがって、trueかfalseのどちらかを返すメソッドだけではなく、「何らかの値」もしくは「nil」を返すメソッドも、条件として使うことができます。
　次の例は配列の中の「林」という文字を含む文字列だけを出力します。
</p>

<p>
List print_hayasi.rb
</p>

<p>
names = ["小林", "林", "高野", "森岡"]
names.each do |name|
  if <i>林</i> =~ name
    puts name
  end
end
</p>

<p>
実行例
</p>

<p>
&gt; ruby print_hayasi.rb
小林
林
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> コマンドを作ろう</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> イントロダクション</h3>
<div class="outline-text-3" id="text-3-1">
<p>
この章では、コマンドラインからデータを受け取り、処理を行う方法を紹介します。また、第１部のまとめとして、Unixのgrepコマンドもどきを作成しましょう。Rubyプログラミングの大まかな流れをつかんでください。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> コマンドラインからのデータの入力</h3>
<div class="outline-text-3" id="text-3-2">
<p>
今まで行ってきたことは、データを画面に出力することでした。「出力」があればその反対、「入力」も試してみたくなります。そもそも、普通に使えるコマンドを作るにはプログラムに動作を指示する方法を知らなければいけません。そこで、Rubyのプログラムにデータを入力してみましょう。
</p>

<p>
プログラムにデータを与えるには、コマンドラインを利用する方法が一番簡単です。コマンドラインの情報をデータとして受け取るには「ARGV」という配列オブジェクトを使います。このARGVという配列は、コマンドラインからスクリプトの引数として与えられた文字列を要素として持っています。
</p>

<p>
List3.1で確認してみましょう。コマンドラインでスクリプトに引数を指定するときは、１つずつ空白で区切って入力してください。
</p>

<div class="org-src-container">

<pre class="src src-ruby"># List3.1 print_argv.rb
puts "最初の引数: #{ARGV[0]}"
puts "2番目の引数: #{ARGV[1]}"
puts "3番目の引数: #{ARGV[2]}"
puts "4番目の引数: #{ARGV[3]}"
puts "5番目の引数: #{ARGV[4]}"
</pre>
</div>

<pre class="example">
実行例
&gt; ruby print_argv.rb 1st 2nd 3rd 4th 5th
最初の引数: 1st
2番目の引数: 2nd
3番目の引数: 3rd
4番目の引数: 4th
5番目の引数: 5th
</pre>

<p>
配列ARGVを使えば、
データをプログラムの中にすべて書いておく必要は無くなります。
配列なので、要素を取り出して変数に代入することもできます。
</p>


<div class="org-src-container">

<pre class="src src-ruby"># List3.2 happy_birth.rb
name = ARGV[0]
print "Happy Birthday, ", name, "!\n"
</pre>
</div>

<pre class="example">
実行例
&gt; ruby happy_birth.rb Ruby
Happy Birthday, Ruby!
</pre>

<p>
引数から取得したデータは文字列になっているので、
これを計算に使うときは数値に変換する必要があります。
文字列を整数にするには、to_iメソッドを使います。
</p>

<ul class="org-ul">
<li>to_i は to integer（整数へ）
</li>
</ul>


<p>
List3.3 arg_arith.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">num0 = ARGV[0].to_i
num1 = ARGV[1].to_i
puts "#{num0} + #{num1} = #{num0 + num1}"
puts "#{num0} - #{num1} = #{num0 - num1}"
puts "#{num0} * #{num1} = #{num0 * num1}"
puts "#{num0} / #{num1} = #{num0 / num1}"
</pre>
</div>

<p>
実行例
</p>

<p>
&gt; ruby arg_arith.rb 5 3
5 + 3 = 8
5 - 3 = 2
5 * 3 = 15
5 / 3 = 1
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> ファイルからの読み込み</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">イントロダクション</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
　Rubyのスクリプトが入力として受け取れるデータは、コマンドライン引数だけではありません。ファイルからデータを読み込むこともできます。
　Rubyのソースコードには、「ChangeLog」というテキストファイルが付いています。これには、誰がどのようにRubyを変更したかが記してあります。
</p>


<p>
＊メモ Rubyのソースコードは、Rubyの公式ウェブサイトから入手できます。Changelogファイルは、GithubのRubyレポジトリからも取得可能です。
</p>

<p>
・Rubyのソースコードダウンロード
　<a href="https://www.ruby-lang.org/ja/downloads/">https://www.ruby-lang.org/ja/downloads/</a>
・Github上のChangelogファイル
　<a href="https://raw.github.com/ruby/ruby/ruby_2_3/ChangeLog">https://raw.github.com/ruby/ruby/ruby_2_3/ChangeLog</a>
</p>


<p>
　このファイルを使って、Rubyでのファイル操作の練習をしてみましょう。
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">3.2.1. ファイルからテキストデータを読み込んで表示する</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
　まず、単純にファイルの中身をすべて表示するプログラムを作ってみましょう。ファイルの中身を表示するプログラムは、次のような流れになります。
</p>

<p>
1.ファイルを開く
2.ファイルのテキストデータを読み込む
3.読み込んだテキストデータを出力する
4.ファイルを閉じる
</p>

<p>
　この流れを、そのままプログラムにしてみましょう。（List3.4）
</p>

<p>
List3.4 read_text.rb
</p>

<div class="org-src-container">

<pre class="src src-ruby">filename = ARGV[0]
file = File.open(filename)  # 1.
text = file.read            # 2.
print text                  # 3.
file.close                  # 4.
</pre>
</div>

<p>
　今までの例に比べると、ちょっとプログラムらしくなってきました。1行ずつ説明します。
　１行目では、filenameという変数にコマンドラインから受け取った最初の引数の値ARGV<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>を代入しています。つまり、変数filenameは読み出したいファイルの名前を示していることになります。
　２行目で使っている「File.open(filename)」は、filenameという名前のファイルを開き、そのファイルを読み込むためのオブジェクトを返します。
……と言われても、「ファイルを読み込むためのオブジェクト」というのが何を意味しているのかよくわからないという方もいるかもしれません。あまり気にせず、ここではそういうオブジェクトがあるとだけ思ってください。詳しくは「第１７章　IOクラス」で説明します。
　この「ファイルを読み込むためのオブジェクト」が実際に使われるのは３行目です。ここでは、「read」というメソッドでデータを読み込み、その結果をtextに代入しています。ここでtextに代入されたテキストデータが、４行目で出力されます。printメソッドは今までにも何度も使ってきたので、もうすっかりおなじみのことでしょう。そして、最後に「close」というメソッドを実行します。これは、開いたファイルを閉じるためのメソッドです。
　このプログラムを次のように実行すると、指定したファイルの内容をそのまま一気に表示します。
</p>

<p>
&gt; ruby read_text.rb 表示したいファイル名
</p>

<p>
　もっとも、ファイルを読み込むだけであれば、File.readメソッドを使うともっと簡単に書けます。（List3.5）
</p>

<p>
List3.5 read_text_simple.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">filename = ARGV[0]
text = File.read(filename)
print text
</pre>
</div>

<p>
　File.readメソッドについても詳しくは「第１７章　IOクラス」で説明します。
　さらに、変数が不要であれば、1行でも書けます。（List3.6）
</p>

<p>
List3.6 read_text_oneline.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">print File.read(ARGV[0])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3">3.2.2. ファイルからテキストデータを1行ずつ読み込んで表示する</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
　ここまでで、まとめて読み込んだテキストデータを表示することができるようになりました。しかし、先ほどの方法では、
</p>

<p>
・ファイルのデータをまとめて読み込むのに時間がかかる
・一時的にすべてのデータをメモリに貯めることになるので、大きなファイルの場合に困ることがある
</p>

<p>
といった問題があります。
　100万行あるようなファイルでも、本当に必要なのは最初の数行だけ、ということもあります。そのような場合、すべてのファイルを読み込むまで何もしない、というのは、時間とメモリを無駄に使ってしまうことになります。
　このような問題を解決するには、データを全て読み込んでから処理を開始するというアプローチをやめる必要があります。
</p>

<p>
・データをすべて読み込んでから処理する
　　ー＞ファイル全体を収めるメモリ空間が必要
</p>

<p>
・一行ずつ読み込んで処理する
　　ー＞メモリ空間は一行分でよい
</p>

<p>
List3.7 read_line.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">filename = ARGV[0]
file = File.open(filename)
file.each_line do |line|
  print line
end
file.close
</pre>
</div>

<p>
　1、2行目は、List3.4と同じです。3行目以降がちょっと変わっています。3行目から5行目はeach_lineメソッドを使っています。
　each_lineメソッドは、第２章で紹介したeachメソッドに似たメソッドです。eachメソッドは配列の各要素をそれぞれ処理するメソッドでしたが、each_lineメソッドはファイルの各行をそれぞれ処理するメソッドです。ここではファイルを一行ずつ読み込み、その行の文字列lineをprintメソッドで出力することで、最終的にすべての行が出力されています。
</p>
</div>
</div>
