takahashi/docs/ruby_for_beginner.org
*** 3.2.3. ファイルの中から特定のパターンの行のみを選んで出力する

　Unixには、grepというコマンドがあります。これは、入力されたテキストデータの中から、正規表現で指定した特定のパターンにマッチする行を出力するコマンドです。これに似たコマンドを作ってみましょう。（List3.8）

List3.8 simple_grep.rb
#+begin_src ruby
pattern = Regexp.new(ARGV[0])
filename = ARGV[1]

file = File.open(filename)
file.each_line do |line|
  if pattern =~ line
    print line
  end
end
file.close
#+end_src

　List3.8を実行するには、次のように入力します。

> ruby simple_grep.rb パターン ファイル名

　少し長くなったので、一行ずつ見ていきましょう。
　Rubyを実行する際にコマンドラインで与えた引数は、ARGV[0]とARGV[1]に代入されます。1行目では、1つ目の引数ARGV[0]を元に正規表現オブジェクトを作り、変数patternに代入します。「Regexp.nre(str)」という形で、引数の文字列strから正規表現オブジェクトを作ります。そして2行目では、2つ目の引数ARGV[1]をファイル名に使う変数filenameに代入します。
　4行目では、ファイルを開き、ファイルオブジェクトを作り、これを変数Fileに代入します。
　5行目はList3.7と同じです。1行ずつ読み込んで変数lineに代入し、8行目までを繰り返します。
　6行目はif文になっています。ここで、変数lineの値である文字列が変数patternの値である正規表現にマッチするかどうか調べます。マッチした場合、7行目のprintメソッドでその文字列を出力します。このif文にはelse節がないので、マッチしなかった場合は何も起こりません。
　すべてのテキストの読み込みが終わったらファイルを閉じて終了します。たとえば、ファイルChangelogから「matz」という文字列が含まれている行を出力したい場合には、次のように実行します。

> ruby simple_grep.rb matz Changelog

「matz」とは、まつもとゆきひろ氏のニックネームです。まつもとゆきひろ氏による変更の履歴が出力されます。

# 16:18

** 3.3. メソッドの作成

　今までいくつかのメソッドを使ってきましたが、自分で作ることもできます。メソッドを作成する構文は次のようになります。

def メソッド名
  メソッドで実行したい処理
end

「Hello, Ruby.」と表示するメソッドを作ってみましょう。

def hello
  puts "Hello, Ruby."
end

　この三行だけを書いたプログラムを実行しても、何も起こりません。helloメソッドが呼び出される前に、プログラムが終わってしまっているからです。そのため、自分で作成したメソッドを実行するコードも必要になります。

List3.9 hello_ruby2.rb
#+begin_src ruby
def hello
  puts "Hello, Ruby."
end

hello()
#+end_src

実行例

> ruby hello_ruby2.rb
hello, Ruby.

「hello()」というメソッド呼び出しにより、1~3行目で定義されたhelloメソッドが実行されます。

** 3.4. 別のファイルを取り込む

　プログラムの一部を、別の新しいプログラムの中で使いまわしたいことがあります。たとえば、あるプログラムで使った自作メソッドを、別のプログラムで利用したい、と言った場合です。
　たいていのプログラミング言語では、別々のファイルに分割されたプログラムを組み合わせて、1つのプログラムとして利用するための機能を持っています。他のプログラムから読み込んで利用するためのプログラムを、ライブラリといいます。
　プログラムの中でライブラリを読み込むには、requireメソッドまたはrequire_relativeメソッドを使います。

require 使いたいライブラリのファイル名

または、

require_relative 使いたいライブラリのファイル名

　使いたいライブラリのファイル名の「.rb」は省略することができます。
　requireメソッドを呼ぶと、Rubyは引数に指定されたライブラリを探して、そのファイルに書かれた内容を読み込みます。ライブラリの読み込みが終わると再び、requireメソッドの次の行から処理を再開します。

　requireメソッドは既存のライブラリを読み込むときに使います。ライブラリ名を指定するだけで、Rubyと一緒にインストールされたライブラリなど、あらかじめ決められた場所から探し出して読み込んでくれます。それに対してrequire_relativeメソッドは、実行するプログラムは置かれたディレクトリ（フォルダ）を基準にしてライブラリを探します。複数のファイルに分けて記述したプログラムを読み込むときに便利です。
　実際の例として、先ほどのsimple_grep.rbの検索部分をライブラリとして、他のプログラムから使ってみましょう。ライブラリといっても別に変わった書き方は必要ありません。simple_grepメソッドを定義したファイル（List3.10）と、それを利用するプログラム（List3.11）を同じディレクトリに作成します。

List3.10 grep.rb
#+begin_src ruby
def simple_grep(pattern, filename)
  file = File.open(filename)
  file.each_line do |line|
    if pattern =~ line
      print line
    end
  end
  file.close
end
#+end_src

List3.11 use_grep.rb
#+begin_src ruby
require_relative "grep"

pattern = Regexp.new(ARGV[0])
filename = ARGV[1]
simple+grep(pattern, filename)
#+end_src

　simple_grepメソッドは検索するパターンとファイル名が必要なので、これらをpatternとfilenameという引数で受け取るようになっています。
　grep.rbで定義したsimple_grepメソッドを、use_grep.rbで呼び出していることに注目してください。List3.8の実行例と同様に、ファイルChangelogから「matz」という文字列が含まれている行を出力したい場合には、次のように実行します。

> ruby use_grep.rb matz Changelog

　Rubyには、たくさんの便利なライブラリが標準で付属しています。これらを利用する場合にrequireメソッドを使います。
　たとえば、dateライブラリを読み込むことで、今日の日付を求めるDate.todayメソッドや特定の日付のオブジェクトを生成するDate.newメソッドなどを利用できるようになります。Rubyの誕生日である1993年2月24日から今日までの日数を求めるプログラムは次のようになります。dateライブラリについては第20章で詳しく説明します。

#+begin_src ruby
require "date"

days = Date.today - Date.new(1993, 2, 24)
puts(days.to_i) 
#+end_src


*** コラム「ppメソッド」

　pメソッドと同じような目的に使われるメソッドとして、ppメソッドがあります。ppは「Pretty Print」の略です。ppメソッドを利用するには、ppライブラリをrequireメソッドで読み込む必要があります。

List p_and_pp.rb
#+begin_src ruby
require "pp"

books = [
  { title: "猫街", author: "荻原翔太郎" },
  { title: "猫の事務所", author: "宮沢賢治" },
  { title: "猫語の教科書", author: "ポール・ギャリコ" },
]
p books
pp books
#+end_src

実行例

> ruby p_and_pp.rb
[{:title=>"猫街", :author=>"萩原翔太郎"}, {:title=>"猫の事務所", :author=>"宮沢賢治"}, {:title=>"猫語の教科書", :author=>"ポール・ギャリコ"}]
[{:title=>"猫街", :author=>"萩原翔太郎"},
 {:title=>"猫の事務所", :author=>"宮沢賢治"},
 {:title=>"猫語の教科書", :author=>"ポール・ギャリコ"}]

　pメソッドとは異なり、ppメソッドはオブジェクトの構造を表示する際に、適当に改行を補ってみやすく整形してくれます。ハッシュの配列のように、入れ子になったコンテナを確認する場合に利用すると良いでしょう。

# - 17:00 2018/7/24
