takahashi/docs/ruby_for_beginner.html

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4">3.2.3. ファイルの中から特定のパターンの行のみを選んで出力する</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
　Unixには、grepというコマンドがあります。これは、入力されたテキストデータの中から、正規表現で指定した特定のパターンにマッチする行を出力するコマンドです。これに似たコマンドを作ってみましょう。（List3.8）
</p>

<p>
List3.8 simple_grep.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">pattern = Regexp.new(ARGV[0])
filename = ARGV[1]

file = File.open(filename)
file.each_line do |line|
  if pattern =~ line
    print line
  end
end
file.close
</pre>
</div>

<p>
　List3.8を実行するには、次のように入力します。
</p>

<p>
&gt; ruby simple_grep.rb パターン ファイル名
</p>

<p>
　少し長くなったので、一行ずつ見ていきましょう。
　Rubyを実行する際にコマンドラインで与えた引数は、ARGV<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>とARGV<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>に代入されます。1行目では、1つ目の引数ARGV<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup>を元に正規表現オブジェクトを作り、変数patternに代入します。「Regexp.nre(str)」という形で、引数の文字列strから正規表現オブジェクトを作ります。そして2行目では、2つ目の引数ARGV<sup><a id="fnr.2.100" name="fnr.2.100" class="footref" href="#fn.2">2</a></sup>をファイル名に使う変数filenameに代入します。
　4行目では、ファイルを開き、ファイルオブジェクトを作り、これを変数Fileに代入します。
　5行目はList3.7と同じです。1行ずつ読み込んで変数lineに代入し、8行目までを繰り返します。
　6行目はif文になっています。ここで、変数lineの値である文字列が変数patternの値である正規表現にマッチするかどうか調べます。マッチした場合、7行目のprintメソッドでその文字列を出力します。このif文にはelse節がないので、マッチしなかった場合は何も起こりません。
　すべてのテキストの読み込みが終わったらファイルを閉じて終了します。たとえば、ファイルChangelogから「matz」という文字列が含まれている行を出力したい場合には、次のように実行します。
</p>

<p>
&gt; ruby simple_grep.rb matz Changelog
</p>

<p>
「matz」とは、まつもとゆきひろ氏のニックネームです。まつもとゆきひろ氏による変更の履歴が出力されます。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> メソッドの作成</h3>
<div class="outline-text-3" id="text-3-4">
<p>
　今までいくつかのメソッドを使ってきましたが、自分で作ることもできます。メソッドを作成する構文は次のようになります。
</p>

<p>
def メソッド名
  メソッドで実行したい処理
end
</p>

<p>
「Hello, Ruby.」と表示するメソッドを作ってみましょう。
</p>

<p>
def hello
  puts "Hello, Ruby."
end
</p>

<p>
　この三行だけを書いたプログラムを実行しても、何も起こりません。helloメソッドが呼び出される前に、プログラムが終わってしまっているからです。そのため、自分で作成したメソッドを実行するコードも必要になります。
</p>

<p>
List3.9 hello_ruby2.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">def hello
  puts "Hello, Ruby."
end

hello()
</pre>
</div>

<p>
実行例
</p>

<p>
&gt; ruby hello_ruby2.rb
hello, Ruby.
</p>

<p>
「hello()」というメソッド呼び出しにより、1~3行目で定義されたhelloメソッドが実行されます。
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 別のファイルを取り込む</h3>
<div class="outline-text-3" id="text-3-5">
<p>
　プログラムの一部を、別の新しいプログラムの中で使いまわしたいことがあります。たとえば、あるプログラムで使った自作メソッドを、別のプログラムで利用したい、と言った場合です。
　たいていのプログラミング言語では、別々のファイルに分割されたプログラムを組み合わせて、1つのプログラムとして利用するための機能を持っています。他のプログラムから読み込んで利用するためのプログラムを、ライブラリといいます。
　プログラムの中でライブラリを読み込むには、requireメソッドまたはrequire_relativeメソッドを使います。
</p>

<p>
require 使いたいライブラリのファイル名
</p>

<p>
または、
</p>

<p>
require_relative 使いたいライブラリのファイル名
</p>

<p>
　使いたいライブラリのファイル名の「.rb」は省略することができます。
　requireメソッドを呼ぶと、Rubyは引数に指定されたライブラリを探して、そのファイルに書かれた内容を読み込みます。ライブラリの読み込みが終わると再び、requireメソッドの次の行から処理を再開します。
</p>

<p>
　requireメソッドは既存のライブラリを読み込むときに使います。ライブラリ名を指定するだけで、Rubyと一緒にインストールされたライブラリなど、あらかじめ決められた場所から探し出して読み込んでくれます。それに対してrequire_relativeメソッドは、実行するプログラムは置かれたディレクトリ（フォルダ）を基準にしてライブラリを探します。複数のファイルに分けて記述したプログラムを読み込むときに便利です。
　実際の例として、先ほどのsimple_grep.rbの検索部分をライブラリとして、他のプログラムから使ってみましょう。ライブラリといっても別に変わった書き方は必要ありません。simple_grepメソッドを定義したファイル（List3.10）と、それを利用するプログラム（List3.11）を同じディレクトリに作成します。
</p>

<p>
List3.10 grep.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">def simple_grep(pattern, filename)
  file = File.open(filename)
  file.each_line do |line|
    if pattern =~ line
      print line
    end
  end
  file.close
end
</pre>
</div>

<p>
List3.11 use_grep.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">require_relative "grep"

pattern = Regexp.new(ARGV[0])
filename = ARGV[1]
simple+grep(pattern, filename)
</pre>
</div>

<p>
　simple_grepメソッドは検索するパターンとファイル名が必要なので、これらをpatternとfilenameという引数で受け取るようになっています。
　grep.rbで定義したsimple_grepメソッドを、use_grep.rbで呼び出していることに注目してください。List3.8の実行例と同様に、ファイルChangelogから「matz」という文字列が含まれている行を出力したい場合には、次のように実行します。
</p>

<p>
&gt; ruby use_grep.rb matz Changelog
</p>

<p>
　Rubyには、たくさんの便利なライブラリが標準で付属しています。これらを利用する場合にrequireメソッドを使います。
　たとえば、dateライブラリを読み込むことで、今日の日付を求めるDate.todayメソッドや特定の日付のオブジェクトを生成するDate.newメソッドなどを利用できるようになります。Rubyの誕生日である1993年2月24日から今日までの日数を求めるプログラムは次のようになります。dateライブラリについては第20章で詳しく説明します。
</p>

<div class="org-src-container">

<pre class="src src-ruby">require "date"

days = Date.today - Date.new(1993, 2, 24)
puts(days.to_i)
</pre>
</div>
</div>


<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1">コラム「ppメソッド」</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
　pメソッドと同じような目的に使われるメソッドとして、ppメソッドがあります。ppは「Pretty Print」の略です。ppメソッドを利用するには、ppライブラリをrequireメソッドで読み込む必要があります。
</p>

<p>
List p_and_pp.rb
</p>
<div class="org-src-container">

<pre class="src src-ruby">require "pp"

books = [
  { title: "猫街", author: "荻原翔太郎" },
  { title: "猫の事務所", author: "宮沢賢治" },
  { title: "猫語の教科書", author: "ポール・ギャリコ" },
]
p books
pp books
</pre>
</div>

<p>
実行例
</p>

<p>
&gt; ruby p_and_pp.rb
[{:title=&gt;"猫街", :author=&gt;"萩原翔太郎"}, {:title=&gt;"猫の事務所", :author=&gt;"宮沢賢治"}, {:title=&gt;"猫語の教科書", :author=&gt;"ポール・ギャリコ"}]
[{:title=&gt;"猫街", :author=&gt;"萩原翔太郎"},
 {:title=&gt;"猫の事務所", :author=&gt;"宮沢賢治"},
 {:title=&gt;"猫語の教科書", :author=&gt;"ポール・ギャリコ"}]
</p>

<p>
　pメソッドとは異なり、ppメソッドはオブジェクトの構造を表示する際に、適当に改行を補ってみやすく整形してくれます。ハッシュの配列のように、入れ子になったコンテナを確認する場合に利用すると良いでしょう。
</p>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p>DEFINITION NOT FOUND.</p></div>

<div class="footdef"><sup><a id="fn.5" name="fn.5" class="footnum" href="#fnr.5">5</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shun Takahashi</p>
<p class="date">Created: 2018-07-25 水 12:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
